{"/home-lab-1/":{"data":{"":"","intro#Intro":"Hypervisors are a core part of building a home lab. Whether it is Proxmox, Hyper-V or even just VirtualBox, a hypervisor gives us a large arena to experiment and test our skills.\nI use Proxmox at home and currently run a two node cluster, one on an old desktop and one on a NUC.\nRef: Beelink S12\nI’ve installed proxmox countless times and I find myself running the same commands over and over again. I will eventually automate more of the hardware portion but after getting Proxmox installed, I make the following configuration changes to hit the ground running:\nAdd a Admin user for the GUI pveum user add admin@pve -comment \"admin user\" pveum passwd admin@pve pveum group add admin -comment \"System Administrators\" pveum acl modify / -group admin -role Administrator pveum user modify admin@pve -group admin Add sudo user on the Debian Host adduser admin usermod -aG sudo admin passwd admin #change the admin account password Generate Proxmox API Token sudo pveum role add TerraformProv \\ -privs '''Datastore.AllocateSpace Datastore.Audit Pool.Allocate Sys.Audit Sys.Console Sys.Modify VM.Allocate VM.Audit VM.Clone VM.Config.CDROM VM.Config.Cloudinit VM.Config.CPU VM.Config.Disk VM.Config.HWType VM.Config.Memory VM.Config.Network VM.Config.Options VM.Migrate VM.Monitor VM.PowerMgmt SDN.Use SDN.Allocate SDN.Audit ''' sudo pveum user add tf-user@pve sudo pveum aclmod / -user tf-user@pve -role TerraformProv sudo pveum user token add tf-user@pve terraform-provisioner --privsep 0 #Make sure to copy the API token displayed in the prompt and store it in a secure place. #It's required to authenticate with the proxmox API. #Token needed in provider config #home-1 = xxxxxxxx-xxxxxxx-xxxxxx-xxxxxxxx sudo pveum aclmod / -token 'tf-user@pve!terraform-provisioner' -role TerraformProv ","prerequisites#Prerequisites":" ℹ️ Familarity with Linux, Proxmox and Terraform ","summary#Summary":"These steps can help anyone get their Proxmox journey started. On a side note , I did not show how to secure SSH access for Proxmox. That is your homework!"},"title":"Home Lab #1: Proxmox Post Install"},"/home_lab/":{"data":{"":"This is a record of my home lab journey from 2024 and onward as well as various cloud native topics and other content as I find it!."},"title":"_index"},"/home_lab/dotfiles_git/":{"data":{"setup#Setup":"Below are some quick steps to get it set up:\n#this prevents you from commiting this directory to the repo creating a weird loop echo \".cfg\" \u003e\u003e .gitignore #clones the repo to the .cfg directory git clone --bare git@github.com:ORG/dotfiles.git $HOME/.cfg #store this alias in your shell rc or alias file alias dev='/usr/bin/git --git-dir=$HOME/.cfg/ --work-tree=$HOME' #cleans up your prompt so you only see untracked files when you explicitly ask for them dev config --local status.showUntrackedFiles no A few notes on the set up above:\nRefresh your shell after adding the alias: Example: echo 'alias dev='/usr/bin/git --git-dir=$HOME/.cfg/ --work-tree=$HOME'' \u003e\u003e .bashrc OR .zshrc \u0026\u0026 . ~/.bashrc or . ~/.zshrc\nAdding files to your repo goes as follows: Example: dev add FILE\nCommit Files: Example: dev commit -a\nPush to repo: Example: dev push\nEnsure the remote origin is configured to point to the dotfiles repo before the first push.\nHere is a link to my public dotfiles for reference. dotfiles\nFeel free to explore and see what works for you. Until next time, stay curious my friends!","summary#Summary":"SummaryTired of manually copying config files to your desktop or rewriting them everytime a new VM or machine is set up?\nThere is easy way to back up your dotfiles and other important config: Git!\nBefore we begin:\nImportant\nMake sure to set up an empty public repo named dotfiles, ensure a README is created and credentials for git access are set up (if cloning via ssh)\nWarning\nDO NOT STORE API KEYS \u0026 OTHER SENSITIVE CREDENTIALS IN YOUR DOTFILES!"},"title":"DevOps Demo 3 - Dotfiles Git Repo"},"/home_lab/hardware/":{"data":{"":"Over the course of 2024, I transformed my home lab into a\nform factor design that could all fit on my desk.","current-specs#Current Specs":"Proxmox Hosts:\n(4) Beelink S12 (1) Beelink S13 "},"title":"Hardware"},"/writing/30_tips_for_30_years/":{"data":{"":" Seek joy in today, tomorrow’s joy will follow Three decades is not a lot of time in the grand scheme of the universe. Don’t focus on time lost but time treasured It’s okay to be angry at someone else It’s okay to be happy for someone else Money is an object but the object is not money. Wake up each day and think of one thing you love about yourself. You’ll feel better. Conflict and change are synonymous. Boundaries are for your mind, body and spirit. Set them accordingly. The best memories are the ones without expectation of the outcome. Grieve your losses. Reflect on your gains. Pick a flower whenever you can, the earth shared it with you after all. Trauma is toxic when ignored but trauma teaches when you pay attention. Wear that crop top! Don’t inflate or devalue others. Eat the cookies at midnight. They tend to taste better Your presence in the present is a present. The top of the hill looks menacing. Trust me, rolling down it is worse Eye contact is appreciated, people have really beautiful eyes. If your intuition is calming telling you to get GTFO, GTFO!!! Instead of rest days, just rest. Don’t be afraid to employ an icebreaker. It tends to bring out people’s humanity A nice cry and a laugh afterwards is some pretty darn good medicine Thank the sun and moon a little more. They’ve been doing it alot longer than we have. For every compliment given to others, give yourself one. Hydrate!! Be your own superhero but NO CAPES!! Tell a joke to a stranger, don’t worry they didn’t pay for tickets. Read this list backwards. #1 will resonate a little more. "},"title":"30 tips for 30 years"},"/writing/meditation_20250108/":{"data":{"":"Fog lands and dampens the surrounding marsh.\nEach step is treacherous, soggy soles afoot.\nThe eyes lie upon the pages from which they view."},"title":"Meditation 8 Jan 2025"}}